CLI_postProc/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          126;
        startFace       89449;
    }
    outlet
    {
        type            patch;
        nFaces          148;
        startFace       89575;
    }
    top
    {
        type            symmetry;
        nFaces          80;
        startFace       89723;
    }
    bottom
    {
        type            symmetry;
        nFaces          80;
        startFace       89803;
    }
    frontAndBack
    {
        type            symmetry;
        nFaces          89872;
        startFace       89883;
    }
   airfoil 
    {
        type            wall;
        inGroups        1(wall);
        nFaces          299;
        startFace       179755;
    }
)

// ************************************************************************* //
