CLI_postProc/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   uniform 1.33e-05;

boundaryField
{
    frontAndBack
    {
        type            symmetry;
    }
    top
    {
        type            symmetry;
    }
    bottom
    {
        type            symmetry;
    }
    airfoil
    {
        type            nutkWallFunction;
        value           $internalField;
    }
    inlet
    {
	type            	     fixedValue;
           value           uniform 1.33e-05;
    }
    outlet
    {
	type            	    zeroGradient;

    }
}


// ************************************************************************* //
